#+TITLE: Nix: The Good, The Bad, and The Useful

#+OPTIONS: toc:1
#+REVEAL_HLEVEL: 2
#+REVEAL_PLUGINS: (highlight notes)

#+PROPERTY: header-args:    :cache yes :exports both    :results output
#+PROPERTY: header-args:nix :eval no   :exports code 
#+PROPERTY: header-args:org :cache no  :exports results :results value raw drawer replace

#+MACRO: lambda  $$ (\lambda s.\!p)(s) $$ 
#+MACRO: mastodon  Mastodon: @sehqlr@mastodon.technology
#+MACRO: slack  stl-tech.slack.com: @sehqlr
#+MACRO: myemail talks+nix@samhatfield.me




** nix repl session                                                :noexport:
   #+begin_src sh :session *nix repl* :cache no
   nix repl '<nixpkgs>'
   #+end_src

   #+RESULTS:
   : Welcome to Nix version 2.2.2. Type :? for help.
   : '...
   : Added 10135 variables.
   : echo 'org_babel_sh_eoe'

*** =/nix/store=
    all packages that are built by nix go into this directory

    YES, this breaks FHS, but we'll return to that in a few slides

    the directory template is =$hash-$name=, where hash is the hash from the build

    #+REVEAL: split
    #+begin_src sh
    nix path-info nixpkgs.curl
    #+end_src

    #+RESULTS:
    : /nix/store/yb6s1k41s7sydr6q3nzmayhvbkzhydvf-curl-7.64.0-bin

*** Dependencies...
    are included within the package!

    #+BEGIN_NOTES
    There's a "wrapping" mechanism for compatibility with Nix

    In this case, each executable in this directory has a wrapped counterpart
    #+END_NOTES

    #+begin_src sh
    find $(nix path-info nixpkgs.emacs) -executable -type f -not -name '*wrapped'
    #+end_src

    #+RESULTS:
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/libexec/emacs/26.1/x86_64-pc-linux-gnu/movemail
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/libexec/emacs/26.1/x86_64-pc-linux-gnu/rcs2log
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/libexec/emacs/26.1/x86_64-pc-linux-gnu/profile
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/libexec/emacs/26.1/x86_64-pc-linux-gnu/hexl
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/bin/emacsclient
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/bin/ctags
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/bin/ebrowse
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/bin/emacs-26.1
    : /nix/store/8j5qqfk1qnz1mjw0z72ih336dzkpkl8w-emacs-26.1/bin/etags

    #+REVEAL: split
    This means that dependency tracking happens during the build step

    this mitigates the broken dependency problem because each package brings their own

*** install via symlink
    installs are done with symlinks from outside the store

    #+begin_src sh
    ls -l $(which curl)
    #+end_src

    #+RESULTS:
    : lrwxrwxrwx 1 root root 68 Dec 31  1969 /run/current-system/sw/bin/curl -> /nix/store/nakc4z4vz69sq2jjlakp64s04qgggvja-curl-7.64.1-bin/bin/curl

    Because you can symlink anywhere, we can reestablish FHS via symlinks. NixOS
    doesn't, but you could!

    BTW, Nix resets all timestamps, that's why the file is so old

*** it's a file!
    surprise!
    #+ATTR_REVEAL: :frag roll-in
    it's JSON
    #+REVEAL: split
     #+begin_src sh
     nix show-derivation nixpkgs.jq | nix-shell -p jq --run jq | head -n10
     #+end_src

     #+RESULTS:
     #+begin_example
     {
       "/nix/store/7g5n296kyk2n11bki54cwpn2n27x597z-jq-1.6.drv": {
         "outputs": {
           "bin": {
             "path": "/nix/store/czdpwxms57dqqv4vixcx6pg6xl8lmsjv-jq-1.6-bin"
           },
           "dev": {
             "path": "/nix/store/zbrd5iga16dagl99bkk8y354rxvsrpqg-jq-1.6-dev"
           },
           "doc": {
     #+end_example

    #+BEGIN_NOTES
    I'm creating a subshell that has jq in the env, running it, to pretty-print
    the JSON of it's derivation. Are you not impressed??
    #+END_NOTES

     
*** derivation keys
    #+begin_src sh
     nix show-derivation nixpkgs.jq | nix-shell -p jq --run "jq '.[] | keys'"
    #+end_src

    #+RESULTS:
    : [
    :   "args",
    :   "builder",
    :   "env",
    :   "inputDrvs",
    :   "inputSrcs",
    :   "outputs",
    :   "platform"
    : ]

    A derivation contains all the information that Nix needs to build a package

    #+REVEAL: split
    Here is where dependency tracking happens: =inputDrvs=
    #+begin_src sh
     nix show-derivation nixpkgs.jq | nix-shell -p jq --run "jq '.[].inputDrvs'"
    #+end_src

    #+RESULTS:
    #+begin_example
    {
      "/nix/store/0si75icim8ajxcsp25d9c52m42kqg1xj-stdenv-linux.drv": [
        "out"
      ],
      "/nix/store/1kircip4wskspsqqzxbmh6ss73iqh9ah-bash-4.4-p23.drv": [
        "out"
      ],
      "/nix/store/4ss7qn4n2nrc0r98ly33hw7s3brvwgcb-jq-1.6.tar.gz.drv": [
        "out"
      ],
      "/nix/store/9gg731fwsxxrl2qmwb17aq4w5r8s5l76-onig-6.9.1.drv": [
        "out"
      ]
    }
    #+end_example

    That =stdenv-linux.drv= is the =build-essentials=-alike I mentioned earlier

*** nix env generations
    Nix has this mechanism called /generations/ where each iteration of an
    update to an environment is tracked by entries in the store

    This means that, in a basic sense, your package actions are version
    controlled.

    #+begin_src sh
    nix-env --list-generations | tail -n5
    #+end_src

    #+RESULTS:
    :  161   2019-04-13 20:44:17   
    :  162   2019-04-13 21:20:19   
    :  163   2019-04-28 14:49:06   
    :  164   2019-04-28 14:51:55   
    :  165   2019-04-28 17:32:00   (current)

    #+REVEAL: split

    And now you will hear my tale of woe... and hope
    
    #+BEGIN_NOTES
    LAPTOP WIFI STORY
    - happened this month
    - changing config to make my setup behave like a nixos module
    - made a change that didn't include networkmanager
    - before, I'd move the laptop to connect to the router via Ethernet
    - but this time, I realized that I could do a rollback
    - rebooted, selected the GRUB entry that I wanted, and BAM! Wifi works
    - that was it!
    - I fixed the config, tested this time, and was able to move forward without losing wifi again
    #+END_NOTES

*** per-user package management
    because each user get's their own environment with their own generations,
    each user can manage their own packages *without sudo*
    
    #+begin_src sh
    ls -l ~/.nix-profile
    #+end_src

    #+RESULTS:
    : lrwxrwxrwx 1 sam users 42 Dec 13 20:06 /home/sam/.nix-profile -> /nix/var/nix/profiles/per-user/sam/profile

*** nix-shell
    Nix comes with a command that can load in a set of packages on demand into a subshell
    #+begin_src sh
    which ruby || echo "no ruby"
    nix-shell -p ruby --run 'which ruby || echo "no ruby"'
    #+end_src

    #+RESULTS:
    : no ruby
    : /nix/store/rwp5fpzqssf5m9dzbgbwsfgdzw8xajra-ruby-2.5.5/bin/ruby

    which means...
    #+REVEAL: split
    SANDBOXES FOR EVERYTHING, no containers required

    Nix comes with tooling to manage this
    
    #+begin_notes
    all you'd need is a GUI for nix-env and you'd have a beginner-safe desktop
    app store for Linux, perhaps?
    #+end_notes

*** dynamically typed
    types are checked at runtime, sometimes coercion occurs
    #+begin_src sh :results output :session *nix repl* :cache no
    1 + 1
    "a" + 1
    #+end_src

    #+RESULTS:
    : 1 + 1
    : 2
    : "a" + 1
    : error: cannot coerce an integer to a string, at (string):1:1
    : "${1}"
    : error: cannot coerce an integer to a string, at (string):1:2
    : echo 'org_babel_sh_eoe'

     #+BEGIN_NOTES
     I'm using an org-babel session to evaluation the nix code since
     spacemacs doesn't have a nix repl feature that I'm aware of, so I guess the
     echo part is with us for the remainder of this trip
     #+END_NOTES
***** equality operators (also for booleans)
      - ==== equality 
      - =!== inequality
      - no function counterparts for these

     #+begin_src sh :session *nix repl* :results output :cache no
     1 + 2 - 3 * 4 / 5.0
     map (builtins.mul 1.0e4) [1 2 3 4]
     #+end_src

     #+RESULTS:
     : 1 + 2 - 3 * 4 / 5.0
     : 0.6
     : map (builtins.mul 1.0e4) [1 2 3 4]
     : [ 10000 20000 30000 40000 ]
     : echo 'org_babel_sh_eoe'

****** logical implication =->= (=!x || y=)
       #+begin_src sh :session *nix repl* :results output :cache no
       true -> 1 < 3
       #+end_src

       #+RESULTS:
       : true
       : echo 'org_babel_sh_eoe'

*** =null=
    Also, =:t= is a REPL command that prints out the type of an expression, like
    in GHCi
    #+begin_src sh :session *nix repl* :results output :cache no
    :t null
    #+end_src

    #+RESULTS:
    : null
    : echo 'org_babel_sh_eoe'
    
    The builtin function =typeOf= also does this

*** =with=-expressions
    dynamic scoping
    #+begin_src sh :session *nix repl* :results output :cache no
    with builtins; map (mul 2) (genList (x: x*x) 7) 
    :a builtins # :a is a repl command that brings a set's attrs into scope
    readDir (dirOf (getEnv "HOME"))
    :r # :r reloads all the files
    #+end_src

    #+RESULTS:
    #+begin_example
    with builtins; map (mul 2) (genList (x: x*x) 7) 
    [ 0 2 8 18 32 50 72 ]
    :a builtins # :a is a repl command that brings a set's attrs into scope
    Added 101 variables.
    readDir (dirOf (getEnv "HOME"))
    { guest = "directory"; sam = "directory"; }
    :r # :r reloads all the files
    '...
    Added 10135 variables.
    echo 'org_babel_sh_eoe'
    #+end_example

**** operations
     #+begin_src sh :session *nix repl* :cache no :results output
     :a builtins
     fromJSON ''{"x": [1, 2, 3], "y": null}''
     hashString "sha256" "moose and squirrel"
     match "ab" "abc"
     match "abc" "abc"
     match "a(b)(c)" "abc"
     :r
     #+end_src

     #+RESULTS:
     #+begin_example
     :a builtins
     Added 101 variables.
     fromJSON ''{"x": [1, 2, 3], "y": null}''
     { x = [ ... ]; y = null; }
     hashString "sha256" "moose and squirrel"
     "ea48540bf8671e37d7e5d3d0b0fea6a0b6b37d06fc977b773a24b52997f036f5"
     match "ab" "abc"
     null
     match "abc" "abc"
     [ ]
     match "a(b)(c)" "abc"
     [ "b" "c" ]
     :r
     '...
     Added 10135 variables.
     echo 'org_babel_sh_eoe'
     #+end_example

** Version string operations
   There are more but here is a sample
  #+begin_src sh :session *nix repl* :cache no :results output
  :a builtins
  compareVersions "1.2.3" "1.2.3"
  compareVersions "1.2.1" "1.2.3"
  compareVersions "1.2.5" "1.2.3"
  splitVersion "1.2.3"
  :r
  #+end_src

  #+RESULTS:
  #+begin_example
  :a builtins
  Added 101 variables.
  compareVersions "1.2.3" "1.2.3"
  0
  compareVersions "1.2.1" "1.2.3"
  -1
  compareVersions "1.2.5" "1.2.3"
  1
  splitVersion "1.2.3"
  [ "1" "2" "3" ]
  :r
  '...
  Added 10135 variables.
  echo 'org_babel_sh_eoe'
  #+end_example
**** operations
     #+begin_src sh :session *nix repl* :cache no :results output
     :a builtins
     baseNameOf /nix/store
     dirOf /nix/store
     :r
     #+end_src

     #+RESULTS:
     #+begin_example
     :a builtins
     Added 101 variables.
     baseNameOf /nix/store
     "store"
     dirOf /nix/store
     /nix
     :r
     '...
     Added 10135 variables.
     echo 'org_babel_sh_eoe'
     #+end_example

     Why are those two not symmetrical???
     
*** zero indexed, square brackets, no commas
    #+begin_src sh :session *nix repl* :results output :cache no
    [ 1 2 3 4 ]
    #+end_src

    #+RESULTS:
    : [ 1 2 3 4 ]
    : echo 'org_babel_sh_eoe'

*** heterogenous
    #+begin_src sh :session *nix repl* :results output :cache no
    [ "foo" 73.1 [ "hello" "world" ] ]
    #+end_src

    #+RESULTS:
    : [ "foo" 73.1 [ ... ] ]
    : echo 'org_babel_sh_eoe'

*** access attributes with =.= syntax
    #+begin_src sh :session *nix repl* :cache no :results output
    let S = { x = 123; foo = "bar"; }; in S.x
    #+end_src

    #+RESULTS:
    : 123
    : echo 'org_babel_sh_eoe'

    #+REVEAL: split
    OR, return a default
    #+begin_src sh :session *nix repl* :cache no :results output
    { x = 123; foo = "bar"; }.y or "default!"
    #+end_src
    
    This is the only time that =or= makes an appearance

    #+RESULTS:
    : "default!"
    : echo 'org_babel_sh_eoe'

*** merge or =//=
    #+begin_src sh :session *nix repl* :cache no :results output
    { sound = 0; dog = "good"; } // { sound = "BARK BARK"; }
    #+end_src

    #+RESULTS:
    : { dog = "good"; sound = "BARK BARK"; }
    : echo 'org_babel_sh_eoe'
    
*** Recursive sets
    normal sets don't have internal scope?
    #+begin_src sh :session *nix repl* :cache no :results output
    { x = y; y = 123; }.x
    let y = "yogurt"; in { x = y; y = 123; }.x
    rec {x = y; y = 123;}.x
    #+end_src

    #+RESULTS:
    : { x = y; y = 123; }.x
    : error: undefined variable 'y' at (string):1:7
    : let y = "yogurt"; in { x = y; y = 123; }.x
    : "yogurt"
    : rec {x = y; y = 123;}.x
    : 123
    : echo 'org_babel_sh_eoe'

*** partial application
    #+begin_src sh :session *nix repl* :cache no :results output
    :t builtins.add 1
    #+end_src

    #+RESULTS:
    : the partially applied built-in function 'add'
    : echo 'org_babel_sh_eoe'

* Nix build system, the useful
  #+begin_src sh :exports both :cache yes
     nix --version
  #+end_src

  #+RESULTS:
  : nix (Nix) 2.2.2
